Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །དེ་དེའི་འོག་ཏུ་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་བསྐལ་པ་བྱེ་བ་ཕྲག་བཅུ་འདས་པ་དང་། བསྐལ་པ་འབུམ་ཚང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ཏེ།
en: “Subsequently, through those roots of merit, after a hundred million eons had passed, and then another hundred thousand eons, he attained the highest, complete enlightenment of perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡེ་ཤེས་དཔའ་བ་ཞེས་བྱ་བར་གྱུར་ནས་དེས་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ཏེ། ཕྱིས་སངས་རྒྱས་ཀྱི་མྱ་ངན་ལས་འདའ་བས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་ཏོ།
en: He became the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha named Jñānaśūra. He benefited countless beings, and afterward he passed away into perfect nirvāṇa.

source: །གཞོན་ནུ་དེ་ནས་སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྒྱལ་པོ་སྟོབས་ཆེན་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དབྱངས་བྱིན་གྱི་དྲུང་དུ་འོངས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་ཏིང་ངེ་འཛིན་འདི་ཐོས་ནས་དགའ་མགུ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ།
en: “Young man, the eighty thousand people who with King Mahābala came into the presence of the Bhagavān, the Tathāgata Ghoṣadatta all heard this samādhi also and were delighted, rejoicing, and joyful.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས་ཡང་དག་པར་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་བར་གྱུར་ཏོ།
en: Happy and joyful, they cut off their hair and beards, wore the orange robes, and with genuine faith they left home for homelessness.

source: །དེ་ལྟར་དེ་དག་ཀྱང་རབ་ཏུ་བྱུང་ནས་ཏིང་ངེ་འཛིན་འདི་བཟུང་སྟེ།
en: Having entered homelessness they learned this samādhi, and having learned it they understood it.

source: །དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་དེ་དག་བསྐལ་པ་བྱེ་བ་ཕྲག་ཉི་ཤུའི་བར་དུ་ནམ་ཡང་ངན་འགྲོ་ལོག་པར་ལྟུང་བར་མ་སོང་སྟེ།
en: Through that root of merit, they did not fall into the lower existences for a hundred million eons.

source: བསྐལ་པ་ཐམས་ཅད་ལ་ཡང་སངས་རྒྱས་བྱེ་བ་རྣམས་མཉེས་པར་བྱས་ནས། དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་ཏིང་ངེ་འཛིན་འདི་ཐོས་ནས་ཏིང་ངེ་འཛིན་འདི་བཟུང་སྟེ།
en: During all those eons, they served ten million buddhas and heard this samādhi from all those tathāgatas. They maintained this samādhi and comprehended it.

source: ཀུན་ཆུབ་པར་བྱས་བཅངས་ཤིང་བཀླགས་ནས་བསྒོམ་པའི་རྣལ་འབྱོར་ལ་རྗེས་སུ་བརྩོན་པར་གནས་ཏེ།
en: They dedicated themselves to the practice of keeping it, reading it, and meditating on it.

source: སྔོན་གྱི་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་བསྐལ་པ་བྱེ་བ་ཕྲག་ཉི་ཤུ་འདས་པ་དང་། དེའི་འོག་ཏུ་བསྐལ་པ་འབུམ་ཚང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: “Through their previous roots of merit, after two hundred million eons had passed and a further hundred thousand eons, they attained the highest, complete enlightenment of perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཚན་དཔའ་བརྟན་ཞེས་བྱ་བ་ཤ་སྟག་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: They all became bhagavāns, tathāgatas, arhats, perfectly enlightened buddhas named Dṛḍhaśūra.

source: དེ་དག་གིས་ཀྱང་སེམས་ཅན་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་སྨིན་པར་བྱས་ཤིང་། དེ་དག་གི་དོན་བྱས་ནས་དེའི་འོག་ཏུ་སངས་རྒྱས་ཀྱི་མྱ་ངན་ལས་འདའ་བས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་ཏོ།
en: They benefited countless beings, and afterward they passed away into perfect nirvāṇa.

source: །གཞོན་ནུ་དེ་ལྟ་བས་ན་རྣམ་གྲངས་འདི་ཉིད་ཀྱིས་འདི་ལྟར་ཏིང་ངེ་འཛིན་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་གཅེས་སྤྲས་བྱེད་པ་ཡིན་ཏེ།
en: “Therefore, young man, because of this teaching, the bodhisattva mahāsattvas cherish in this way this samādhi.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་བླ་ན་མེད་པ་སྡུད་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: They know that it is composed of the unsurpassable wisdom of omniscience.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་སྔོན་བྱུང་བའི་ལེའུ་འདི་ཉིད་རྒྱས་པར་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: Then, at that time, the Bhagavān gave a detailed teaching by chanting the following extensive verses to the youth Candraprabha.

source: །ངས་དྲན་བསམ་གྱིས་མི་ཁྱབ་བསྐལ་པ་ན།
en: “I remember, countless eons ago

source: །འདས་པའི་དུས་ན་མི་ཡི་གཙོ་བོ་ནི། །དྲང་སྲོང་ཆེན་པོ་འཇིག་རྟེན་དོན་མཛད་བྱུང་།
en: In the past, a supreme human, a great sage Who benefited beings appeared in the world,

source: །དེ་ཡི་མཚན་ནི་དབྱངས་ཀྱི་བྱིན་ཞེས་བྱ། །བྱེ་བྲག་བརྒྱད་ཅུར་ཡོངས་སུ་ཚང་བ་ཡི།
en: And he was known by the name Ghoṣadatta. {12}

source: །དེ་ཡི་ཉན་ཐོས་འཁོར་མང་དང་པོ་བྱུང་།
en: “The first assembly of his students Numbered eight hundred million.

source: །གཉིས་པ་བྱེ་བ་བདུན་ཅུར་ཚང་བ་བྱུང་།
en: The second was seven hundred million.

source: །གསུམ་པ་དགྲ་བཅོམ་བྱེ་བ་དྲུག་ཅུ་ཡོད།
en: The third was six hundred million arhats. {13}

source: །ཀུན་ཀྱང་ཟག་པ་ཟད་ཅིང་ཉོན་མོངས་མེད།
en: “All had eliminated defilements and were without kleśas.

source: །ཐམས་ཅད་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ཕ་རོལ་ཕྱིན།
en: All had attained the perfection of miraculous powers.

source: །ཚེ་ཚད་ལོ་ནི་སྟོང་ཕྲག་བཞི་བཅུ་སྟེ།
en: The lifespan was forty thousand years

source: །ཞིང་ཡང་ཡོངས་སུ་དག་ཅིང་མཛེས་པར་གྱུར།
en: And the realm was perfectly pure and beautiful. {14}

source: །སྐྱོབ་པ་དེ་ཡི་བྱང་ཆུབ་སེམས་དཔའ་གང་བྱུང་བ།
en: “The bodhisattvas of that protector

source: །དཔག་མེད་དེ་དག་གཞན་ཕན་དབང་བསྐུར་ཐོབ།
en: Were consecrated to immeasurably benefit others.

source: །དབང་དང་ས་ལ་རབ་ཏུ་གནས་པ་སྟེ།
en: They were well established through their powers and levels.

source: །ཤིང་མཆོག་དྲུང་དུ་བྱང་ཆུབ་འཚང་རྒྱར་ཉེ།
en: They were near to buddhahood beneath the sacred tree. {15}

source: །འཛམ་བུའི་གླིང་འདིར་རྒྱལ་པོ་བྱུང་བ་ནི།
en: “In this Jambudvīpa there were kings

source: །སྟོབས་བརྟན་དང་ནི་སྟོབས་ཆེན་ཞེས་བྱ་བ།
en: Named Dṛḍhabala and Mahābala.

source: །གཅིག་ནི་དེ་ཡི་ཕྱེད་དབང་རྒྱལ་པོ་བྱེད།
en: One king ruled half the world,

source: །ཅིག་ཤོས་ཕྱེད་ལ་དབང་བའི་རྒྱལ་པོར་གྱུར། །རྒྱལ་པོ་སྟོབས་ཆེན་རྣམ་པར་རྒྱལ་བའི་སར།
en: The other was king over the other half. {16}

source: །ལྷ་དང་མིས་མཆོད་སངས་རྒྱས་བྱུང་བར་གྱུར།
en: “The Buddha, to whom humans and devas made offerings, Had appeared within the domain of King Mahābala.

source: །བདེ་བར་གཤེགས་ལ་རྒྱལ་པོ་དད་རྙེད་ནས།
en: The king gained faith in the Sugata

source: །ལོ་གྲངས་སྟོང་དུ་ཚང་བར་བསྙེན་བཀུར་བྱས།
en: And attended him for a thousand years. {17}

source: །སེམས་ཅན་གཞན་མང་དེ་ཡི་རྗེས་སློབ་པས།
en: “Many other beings, following his example,

source: །དེ་བཞིན་གཤེགས་པ་ལ་ཡང་བཀུར་སྟི་བྱེད།
en: Also honored the Tathāgata

source: །འཇིག་རྟེན་ཟང་ཟིང་གིས་ཏེ་ཆོས་ཀྱིས་མིན།
en: With worldly goods and not through the Dharma.

source: །ཉན་ཐོས་བཅས་པ་རྙེད་པ་མང་བར་གྱུར།
en: They gave many things to the śrāvakas also. {18}

source: །སྐྱེས་བུ་དམ་པའི་སེམས་ནི་འདི་སྙམ་སྟེ།
en: “The highest of beings had this thought: ‘I shall teach the Dharma to these who desire the Dharma

source: །ཅི་ནས་འདི་ཀུན་འདོད་པ་རབ་སྤངས་ནས།
en: So that they will all give up desire

source: །ང་ཡི་བསྟན་པ་འདི་ལ་རབ་འབྱུང་བར།
en: And enter into homelessness in my teaching.’ {19}

source: །ཆོས་འདོད་འདི་དག་ལ་ནི་ཆོས་བསྟན་སྙམ།
en: “The highest of humans taught in verses

source: །བདེ་བར་གཤེགས་པའི་སྦྱངས་ཆོས་བསླབ་པ་དང་། །ཁྱིམ་གནས་ཉེས་པ་སྡུག་བསྔལ་མཐའ་ཡས་དང་། །ཆོས་ལ་སྒྲུབ་པ་ཆོས་ཀྱི་མཆོད་ཡིན་ཞེས།
en: The practice of following the Dharma of the sugatas, The endless suffering and harm of living in a home, And that practicing the Dharma is offering to the Dharma. {20}

source: །མི་མཆོག་དེས་ནི་ཚིགས་སུ་བཅད་པ་གསུངས། །ས་བདག་རྒྱལ་པོས་ཚིགས་བཅད་དེ་ཐོས་ནས།
en: “When the king, the sovereign, had heard those verses,

source: །མི་དབང་གཅིག་པུ་དབེན་སོང་བསམས་པ་ནི།
en: That ruler of men contemplated entering solitude.

source: །ཁྱིམ་ན་གནས་བཞིན་དུ་ཡང་ཐམས་ཅད་ཀྱིས།
en: He thought that all who dwell at home

source: །ཆོས་ཀྱི་མཆོད་མཆོག་བྱ་བར་མི་ནུས་སྙམ།
en: Are unable to make the supreme offering to the Dharma. {21}

source: །མཆིལ་མ་བཞིན་དུ་རྒྱལ་སྲིད་དེས་བཏང་སྟེ།
en: “He cast away the kingdom like a lump of phlegm

source: །སྲོག་ཆགས་སྟོང་ཕྲག་བརྒྱད་ཅུར་བཅས་པ་དག །རྒྱལ་བ་དེ་ཡི་དྲུང་དུ་ཉེར་འོངས་ཏེ།
en: And together with eighty thousand persons He came into the presence of the Jina,

source: །ཞབས་ལ་ཕྱག་འཚལ་ནས་ནི་སྤྱན་སྔར་འདུག །རྒྱལ་བས་དེ་དག་གི་ཡང་བསམ་མཁྱེན་ནས།
en: Bowed to his feet, and sat before him. {22} “The Jina, knowing what they intended,

source: །ཏིང་འཛིན་ཞི་བ་བལྟ་དཀའ་འདི་བཤད་དེ།
en: Taught this samādhi of peace that is difficult to see.

source: །དེ་དག་དགའ་ཞིང་རབ་མོས་བདེ་བས་ཚིམ།
en: Happy, inspired, and joyful, they were satisfied.

source: །མགུ་ཞིང་རངས་པས་དེ་ཚེ་རབ་ཏུ་བྱུང་།
en: Pleased and delighted, they entered homelessness. {23}

source: །དེ་དག་རབ་བྱུང་ཏིང་འཛིན་འདི་བཟུང་སྟེ།
en: “Homeless, they possessed this samādhi.

source: །བཅངས་ཤིང་བཀླགས་ཏེ་ཡོངས་སུ་ཆུབ་བྱས་ནས།
en: They kept it, read it, and understood it.

source: །བསྐལ་པ་བྱེ་བ་ཉི་ཤུ་ཚང་བར་ནི།
en: For two hundred million eons

source: །ནམ་ཡང་ངན་འགྲོ་ལོག་ལྟུང་སོང་མ་གྱུར།
en: They did not fall into the lower existences. {24}

source: །དེ་དག་ཐམས་ཅད་དགེ་བའི་རྩ་བ་དེས།
en: “Because of those roots of merit,

source: །སངས་རྒྱས་བྱེ་བ་ཕྲག་སྟོང་ལེགས་པར་མཐོང་།
en: They all saw ten thousand million buddhas

source: །རྒྱལ་བ་དེ་དག་ཀུན་གྱི་བསྟན་པ་ལ།
en: And in the teaching of those jinas

source: །དེ་དག་རབ་བྱུང་ཏིང་འཛིན་འདི་ལ་བསྒོམ།
en: They entered homelessness and meditated on this samādhi. {25}

source: །དེ་དག་ཕྱི་མའི་དུས་ལ་སངས་རྒྱས་གྱུར།
en: “In later times they became buddhas

source: །མཐའ་ཡས་བརྩོན་པ་མིང་ནི་དཔའ་བརྟན་ཡིན།
en: With infinite diligence, all named Dṛḍhaśūra.

source: །སྲོག་ཆགས་བྱེ་བ་མང་པོའི་དོན་བྱས་ཏེ།
en: They benefited many millions of beings

source: །ཕྱི་མའི་དུས་ལ་མེ་བཞིན་མྱ་ངན་འདས།
en: And after, like an extinguished flame, attained nirvāṇa. {26}

source: །སྔོན་ཚེ་རྒྱལ་པོ་སྟོབས་ཆེན་བྱུང་བ་ནི།
en: “The one who previously had been King Mahābala

source: །སངས་རྒྱས་ཡེ་ཤེས་དཔའ་བ་འཇིག་རྟེན་བྱུང་།
en: Appeared in the world as Buddha Jñānaśūra.

source: །དེ་ཚེ་སྲོག་ཆགས་བྱེ་སྟོང་མང་པོ་རྣམས།
en: He brought many billions of beings

source: །བྱང་ཆུབ་བཀོད་ནས་ཕྱི་དུས་མྱ་ངན་འདས།
en: To enlightenment, and then attained nirvāṇa. {27}

source: །དེ་ཕྱིར་སངས་རྒྱས་དག་གིས་བརྗོད་པ་ཡི། །མདོ་འདི་ཕྱི་དུས་ཐོས་ནས་གཟུང་བར་གྱིས།
en: “Therefore you who, in later times, hear and possess This sūtra that has been taught by the buddhas:

source: །འདི་ལྟ་བུ་ཡི་ཆོས་མཛོད་འདི་བཟུང་ན།
en: If you possess this treasure of the Dharma

source: །མི་ཡི་གཙོ་བོར་མྱུར་དུ་འགྲུབ་པར་འགྱུར།
en: You will quickly become a supreme human.” {28}

source: །དབྱངས་བྱིན་གྱི་ལེའུ་སྟེ་ལྔ་པའོ།། །།
en: Conclusion of the fifth chapter, “Ghoṣadatta.” Cultivating the Samādhi Chapter 6

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་འདོད་ཅིང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཏིང་ངེ་འཛིན་འདི་ཡོངས་སུ་སྦྱང་བར་བྱའོ།
en: The Bhagavān now said to the youth Candraprabha, “Therefore, young man, bodhisattva mahāsattvas who wish for this samādhi, and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, should cultivate this samādhi.

source: །གཞོན་ནུ་དེ་ལ་ཏིང་ངེ་འཛིན་ཡོངས་སུ་སྦྱང་བ་གང་ཞེ་ན།
en: “Young man, what is the cultivation of this samādhi?

source: གཞོན་ནུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྙིང་རྗེ་ཆེན་པོ་ལ་ཞུགས་པའི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་བཞུགས་པའམ། །ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་རྣམས་ལ་འདི་ལྟ་སྟེ། ཆོས་གོས་དང་བསོད་སྙོམས་དང་མལ་ཆ་དང་ན་བའི་གསོས་སྨན་དང་ཡོ་བྱད་རྣམས་དང་མེ་ཏོག་དང་བདུག་པ་དང་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་གདུགས་དང་རྒྱལ་མཚན་དང་རྣམ་པར་རྒྱལ་བའི་བ་དན་རྣམས་དང་རོལ་མོ་དང་སིལ་སྙན་རྣམས་ཀྱིས་མཆོད་པར་བྱ་བ་ལ་བརྩོན་པ་ཡིན་ཏེ།
en: Young man, bodhisattva mahāsattvas with a compassionate mind are dedicated to making offerings to the tathāgatas, whether living or passed into nirvāṇa, of Dharma robes, alms, seat and bedding, medicines for when ill, and of monastic utensils, and of flowers, incense, perfume, garlands, ointments, aromatic powders, clothing, parasols, banners, and flags, and of music and musical instruments.

source: དགེ་བའི་རྩ་བ་དེ་ཡང་ཏིང་ངེ་འཛིན་ཐོབ་པར་ཡོངས་སུ་བསྔོའོ།
en: They dedicate that root of merit to the attainment of samādhi.

source: །དེ་ཆོས་གང་ལ་ཡང་རེ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་མི་བྱེད་དེ། འདོད་པ་ལ་རེ་བ་མ་ཡིན། ལོངས་སྤྱོད་ལ་རེ་བ་མ་ཡིན། མཐོ་རིས་ལ་རེ་བ་མ་ཡིན། འཁོར་བ་ལ་རེ་བ་མ་ཡིན་གྱི་དེ་ནི་ཆོས་ལ་སེམས་པ་ཡིན་ནོ།
en: They do not make offerings to a tathāgata with the hope for anything at all—not with the hope for anything they desire, nor with the hope for any enjoyment, nor with the hope for a higher existence, nor with the hope for followers—but do so with the Dharma in mind.

source: །དེ་འདོད་ན་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྐུར་ཡང་མི་དམིགས་ན་དེ་གཟུགས་ཀྱི་སྐུར་ལྟ་ག་ལ་ཞིག་དམིགས་པར་འགྱུར།
en: They do not even, with that wish, perceive the Tathāgata as the dharmakāya, let alone perceiving him as the rūpakāya.

source: གཞོན་ནུ་དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མཆོད་པ་དེ་ནི་འདི་ཡིན་ཏེ། འདི་ལྟ་སྟེ།
en: “Young man, it is in that way that an offering is made to the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་མི་མཐོང་བ་དང་། བདག་ཉིད་མི་དམིགས་པ་དང་། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བའོ།
en: It is done without seeing the tathāgatas, without focusing on the self, and without any desire for the ripening of karma.

source: །གཞོན་ནུ་འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་མཆོད་པ་འདིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་ན་ཏིང་ངེ་འཛིན་འདི་རབ་ཏུ་འཐོབ་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མྱུར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Young man, if an offering made to a tathāgata is purified of those three aspects of the action, this samādhi will be attained and the highest, complete enlightenment of perfect buddhahood will be quickly reached.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་ཏིང་ངེ་འཛིན་ཡོངས་སུ་སྦྱང་བ་བསྟན་པ་འདི་རྒྱས་པར་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: At this point the Bhagavān gave a detailed teaching on the cultivation of the samādhi by chanting the following extensive verses to the youth Candraprabha.

source: །ཡེ་ཤེས་མཐའ་ཡས་པ་ལ་སྤོས་ཕུལ་བས།
en: “Through offering incense to infinite wisdom

source: །སྐྱེས་བུ་རྣམས་ཀྱི་དྲི་ཡང་མཐའ་ཡས་འགྱུར།
en: Beings will have an infinite aroma.

source: །བསྐལ་པ་བྱེ་བར་ངན་འགྲོར་དེ་མི་འགྲོ །དེ་དག་དྲི་བསུང་ང་བར་ཡོང་མི་འགྱུར།
en: In ten million eons they will not go to the lower realms, And no bad smells will come from them. {1}

source: །དེ་དག་བསྐལ་པ་བྱེ་བར་སྤྱད་སྤྱོད་ཅིང་།
en: “For ten million eons they will practice bodhisattva conduct

source: །སངས་རྒྱས་བྱེ་བ་སྟོང་ལ་མཆོད་བྱས་ནས།
en: And make offerings to ten thousand million buddhas.

source: །དེ་དག་ཡེ་ཤེས་སྤོས་ཀྱིས་མངོན་འཕགས་ཏེ།
en: The aroma of wisdom will arise so that they

source: །སངས་རྒྱས་ཚུལ་ཁྲིམས་དྲི་མཆོག་ལྡན་པར་འགྱུར།
en: Will become buddhas with the aroma of supreme conduct. {2}

source: །གལ་ཏེ་སེམས་ཅན་གང་དག་སྤོས་བྱིན་དང་། །དེ་བཞིན་གང་ལ་སྦྱིན་པར་བྱ་བ་དང་། །སེམས་འདིས་སྦྱིན་པར་བྱེད་པ་མེད་ཤེས་ན།
en: “If any beings know that the incense they offer, Those to whom they offer it, And the minds that offer incense do not exist,

source: །དེ་ནི་དེ་ཡི་འཐུན་བཟོད་ཆུང་ངུ་ཡིན།
en: The ‘concordant patience’ they have is of lesser kind. {3}

source: །བཟོད་པ་ཆེན་པོ་བསྟེན་པ་དེ་ལ་ནི།
en: “But if a person maintains a patience that is great,

source: །བསྐལ་པ་བྱེ་བ་གང་གཱའི་བྱེ་སྙེད་དུ། །མི་ཡིས་ཁམ་ཚད་ཙམ་དུ་བཅད་གཏུབས་ཀྱང་།
en: Even were they cut up, for ten million eons, Into tiny pieces as numerous as the Ganges sands,

source: །དེ་ཡི་སེམས་ནི་ལྡོག་པར་ཡོང་མི་འགྱུར།
en: Their mind will never regress. {4}

source: །ཅི་ཡི་ཕྱིར་ན་བཟོད་པའི་མིང་དུ་གདགས།
en: “Why is this termed ‘patience’?

source: །ཇི་ལྟར་རྗེས་སུ་འཐུན་པ་ཞེས་ཀྱང་བྱ།
en: And why is it called ‘concordant’?

source: །གང་གི་རྒྱུས་ནི་ཕྱིར་མི་ལྡོག་ཅེས་བྱ།
en: For what reason is it said to be ‘nonregressive’?

source: །ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་ཀྱང་བརྗོད།
en: And why are they called ‘bodhisattvas’? {5}

source: །རང་བཞིན་བདག་མེད་ཆོས་ལ་དེ་བཟོད་དེ།
en: “Their patience being for the selfless nature of phenomena,

source: །བདག་མེད་འདུ་ཤེས་པ་ལ་ཉོན་མོངས་མེད།
en: Those who perceive selflessness have no kleśas.

source: །ཆོས་རྣམས་ཐམས་ཅད་ནམ་མཁའ་ཇི་བཞིན་ཤེས།
en: They know that all phenomena are like space.

source: །དེ་ཕྱིར་དེ་ལ་བཟོད་པའི་མིང་དུ་བཏགས།
en: That, therefore, is what is termed ‘patience.’ {6}

source: །རྒྱལ་བ་ཀུན་གྱི་རྗེས་སུ་འཐུན་སློབ་ཅིང་།
en: “They train in accord with all the jinas.

source: །མཁས་པ་དེ་ནི་ཆོས་མིན་མི་སྤྱོད་དེ།
en: Those wise ones do not practice non-Dharma.

source: །སངས་རྒྱས་ཆོས་ལ་ཐེ་ཙོམ་མི་སྐྱེད་པ།
en: They do not doubt the Buddha’s Dharma.

source: །དེ་ནི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཡིན།
en: That is the patience that is ‘concordant.’ {7}

source: །དེ་ལྟར་སྤྱོད་པ་དག་ལ་འཇིག་རྟེན་ན། །ཇི་སྙེད་བདུད་ཡོད་སངས་རྒྱས་གཟུགས་བསྒྱུར་ནས།
en: “Even if all the māras in the world transformed

source: །བྱང་ཆུབ་རྙེད་དཀས་ཉན་ཐོས་གྱིས་ཤིག་ཅེས།
en: Into buddhas and said to such practitioners, ‘Enlightenment is too difficult! So become a śrāvaka!’

source: །ཚིག་ཏུ་སྨྲ་ཡང་མི་འཛིན་ལྡོག་མི་འགྱུར།
en: They would not believe those words and would not regress. {8}

source: །སེམས་ཅན་མི་འཐུན་ལྟ་ལས་རྟོག་བྱེད་ཅིང་།
en: “If they know of the incorrect view of beings

source: །མི་འཆི་འཐོབ་པའི་ལམ་ནི་འདིའོ་ཞེས།
en: They say, ‘This is not the path to deathlessness!’

source: །ལོག་པའི་ལམ་སྤངས་ལམ་ལ་འཇོག་པར་བྱེད།
en: So that they reject the wrong path and are brought to the true path.

source: །དེ་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་ཀྱང་བྱ།
en: That is the reason why they are called bodhisattvas. {9}

source: །རྗེས་སུ་འཐུན་བཟོད་ལམ་ལ་གནས་པ་དང་། །བདག་མེད་ཤེས་པས་སད་པར་བྱས་པ་ལ།
en: “They remain upon the path of concordant patience And are awake through the knowledge of selflessness.

source: །རྨི་ལམ་ན་ཡང་མི་དང་གང་ཟག་དང་། །སྲོག་དང་སེམས་ཅན་ཡོད་པར་ཡོང་མི་འཛིན།
en: Even in a dream they do not believe In humans, persons, souls, or beings. {10}

source: །བདུད་རྣམས་བྱེ་བ་གང་གཱའི་བྱེ་མ་སྙེད།
en: “Even if as many millions of māras as there are Ganges sands

source: །སངས་རྒྱས་གཟུགས་བསྒྱུར་དེ་དག་དྲུང་འོངས་ཏེ།
en: Came before them in the forms of buddhas,

source: །ལུས་ཀྱི་ནང་ན་སྲོག་མེད་གྱུར་ན་ནི།
en: And said to them that there is a soul within the body,

source: །ཁྱེད་ཅག་སངས་རྒྱས་འགྲུབ་པ་མིན་ཞེས་སྨྲ།
en: They would reply that it was not so and say, ‘You are not buddhas.’ {11}

source: །ཡེ་ཤེས་ཀྱིས་ནི་ཕུང་པོ་སྟོང་པར་ཤེས།
en: “Through wisdom I know that the skandhas are empty.

source: །ཤེས་ནས་ཉོན་མོངས་རྣམས་དང་ང་མི་འགྲོགས།
en: Because I know that, I am unaccompanied by kleśas.

source: །ཐ་སྙད་ཙམ་གྱིས་རྣམ་པར་སྤྱོད་བྱེད་ཅིང་།
en: In my conduct I use mere words

source: །འཇིག་རྟེན་འདི་ན་མྱ་ངན་འདས་པར་གནས།
en: But within this world remain within nirvāṇa, {12}

source: །ཇི་ལྟར་སྐྱེས་བུ་དག་གི་བུ་སྐྱེས་ནས།
en: “Just as when a man has a son born to him

source: །འདི་ཡི་མིང་ནི་འདི་ཞེས་མིང་བཏགས་པ།
en: And gives him a name, saying, ‘This is his name!’

source: །ཕྱོགས་རྣམས་སུ་ཡང་དེ་ཡི་མིང་མི་རྙེད།
en: But that name cannot be found anywhere.

source: །མིང་དེ་གང་ནས་ཀྱང་ནི་འོངས་པ་མེད།
en: And that name did not come from anywhere. {13}

source: །དེ་བཞིན་བྱང་ཆུབ་སེམས་དཔའ་མིང་བཏགས་ཏེ།
en: “In that way the name ‘bodhisattva’ is given,

source: །བྱང་ཆུབ་སེམས་དཔའ་འདི་ཞེས་ཡོངས་བཙལ་ཀྱང་།
en: But if one seeks for this ‘bodhisattva’

source: །ཕྱོགས་རྣམས་ན་ཡང་དེ་ཡི་མིང་མི་རྙེད།
en: That name will not be found anywhere.

source: །དེ་ལྟར་གང་ཤེས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན།
en: One who knows that is a bodhisattva. {14} “The bodhisattvas do not believe in the existence of a self

source: །རྒྱ་མཚོའི་དབུས་ནས་ཇི་སྟེ་མེ་འབར་ཡང་། །བྱང་ཆུབ་སེམས་དཔའ་འཇིག་ཚོགས་ལྟ་བ་མེད།
en: Any more than that a fire can burn in the middle of the ocean.

source: །འདི་ལྟར་བྱང་ཆུབ་སེམས་བསྐྱེད་ཚུན་ཆད་ནི།
en: Since they have developed the aspiration for enlightenment

source: །དེ་ལ་སྲོག་ཏུ་ལྟ་བར་འགྱུར་བ་མེད།
en: They have not had the view that there is a soul within. {15}

source: །འདི་ལ་གང་ཡང་སྐྱེས་ཤིང་ཤི་མེད་དེ།
en: “There is no birth and there is no death

source: །མིང་དང་ཤེད་སྐྱེས་སེམས་ཅན་བྱུང་བ་མེད།
en: For beings, humans, the descendants of Manu.

source: །ཆོས་རྣམས་རང་བཞིན་སྟོང་པ་སྒྱུ་མ་བཞིན།
en: Phenomena have an empty nature, like illusions;

source: །མུ་སྟེགས་ཅན་གྱིས་རྣམ་པར་རིག་མི་ནུས།
en: The tīrthikas are unable to know that. {16}

source: །ཁ་ཟས་དག་ལ་ཤིན་ཏུ་བརྐམ་པ་དང་། །ལྷུང་བཟེད་གོས་ལ་ཆགས་ཤིང་ཞེན་མེད་དང་། །འཕྱར་བ་རྣམས་དང་ཁེངས་པ་དག་གིས་ཀྱང་།
en: “Also those who crave for food, Who desire and cling to alms bowls and robes, Who are arrogant and are haughty,

source: །སངས་རྒྱས་བྱང་ཆུབ་འདི་ནི་ཤེས་མི་ནུས།
en: They cannot understand the Buddha’s enlightenment. {17}

source: །གཉིད་དང་རྨུགས་པས་ནོན་པས་ལེ་ལོ་ཅན།
en: “The lazy who are overcome by sleepiness and dullness,

source: །ང་རྒྱལ་ཅན་དང་ཁྲེལ་མེད་འགྱིང་བ་དང་། །སུ་དག་སངས་རྒྱས་ལ་ནི་དད་མེད་པ།
en: Who have stubborn minds, and are shameless, Who have no faith in the Buddha,

source: །དེ་དག་བྱང་ཆུབ་དམ་པ་ཤེས་མི་ནུས།
en: They are unable to understand sublime enlightenment. {18}

source: །ཚུལ་ཉམས་པ་ཡི་སོ་སོའི་སྐྱེ་བོ་དང་། །གང་དག་ཆོས་ལ་དད་པ་མེད་པ་དང་། །ཚངས་པ་མཚུངས་སྤྱོད་དག་ལ་རི་མོ་མེད།
en: “The ordinary beings with incorrect behavior, Those who do not have faith in the Dharma, Who have no respect toward celibates,

source: །དེ་དག་བྱང་ཆུབ་འདི་ནི་རྟོགས་མི་ནུས།
en: They are unable to understand enlightenment. {19}

source: །ཚུལ་མ་ཉམས་ཤིང་ཁྲེལ་ཡོད་ངོ་ཚ་ཤེས།
en: “Those with correct behavior, who have modesty and self-respect,

source: །ཆོས་དང་སངས་རྒྱས་དག་ལ་གང་དགའ་ཞིང་།
en: Who delight in the Dharma and the buddhas,

source: །ཚངས་པ་མཚུངས་སྤྱོད་དག་ལ་རབ་ཏུ་གུས།
en: Who show great respect to the practitioners of celibacy,

source: །དེ་དག་བྱང་ཆུབ་དམ་པ་མཆོག་འཐོབ་འགྱུར།
en: They will attain the supreme, highest enlightenment. {20}

source: །གང་དག་སྤྱོད་ཡུལ་དྲན་པ་ཉེ་བར་གཞག །བདེ་ཞིང་དགའ་བའི་མལ་དུ་ཞུགས་པ་དང་། །ཟས་སུ་བསམ་གཏན་སྐོམ་དུ་ཏིང་ངེ་འཛིན།
en: “Those whose conduct is performed with mindfulness, Who sit upon their cushion with joy and delight, With dhyāna as food and samādhi for drink,

source: །དེ་དག་གིས་ཀྱང་བྱང་ཆུབ་མཆོག་རབ་འཐོབ།
en: They will attain the supreme, highest enlightenment. {21}

source: །བདག་མེད་པ་ཡི་འདུ་ཤེས་ཉིན་པར་གནས།
en: “Those who understand selflessness all day long,

source: །འཆག་སར་སྟོང་པ་དང་ནི་རྗེས་སུ་དྲན།
en: Who are mindful of emptiness as they walk,

source: །བྱང་ཆུབ་ཡན་ལག་མེ་ཏོག་ཡིད་འོང་བསུང་།
en: Who bear the beautiful aromatic flowers of the aspects of enlightenment,

source: །བརྩོན་པ་དེ་དག་བྱང་ཆུབ་དམ་པ་ཐོབ།
en: Those dedicated ones will attain supreme enlightenment. {22}

source: །བྱང་ཆུབ་སེམས་དཔའ་མཁས་པའི་སྤྱོད་པ་དག །སྐྱེ་བོ་གཞན་རྣམས་དང་ནི་ཉན་ཐོས་དང་། །རང་སངས་རྒྱས་ཀྱི་ས་ཡང་མ་ཡིན་ན།
en: “They who are skilled in bodhisattva conduct Are not on the level of other beings, Of śrāvakas, or of pratyekabuddhas.

source: །དེ་ལ་རྟོགས་པར་སུ་ཞིག་འདུན་མི་སྐྱེད།
en: Who would not aspire to that realization? {23}

source: །གལ་ཏེ་བསྐལ་བྱེ་གང་གཱའི་བྱེ་མ་སྙེད། །དེ་སྲིད་དུ་ནི་ཚེ་ཡི་ཚད་གྱུར་ནས། །ངས་ནི་སངས་རྒྱས་ཀྱི་ཡང་ཡེ་ཤེས་ཀྱི།
en: “If I were to have a lifespan that continued For as many millions of eons as there are sands in the Ganges,

source: །སྤུ་གཅིག་བསྔགས་པ་བརྗོད་ཀྱང་མཐར་མི་ཕྱིན།
en: I would not even be able to finish reciting the praises Of as little of the Buddha’s wisdom as a tiny pore. {24}

source: །དེ་ཕྱིར་ཟིལ་གྱིས་མི་ནོན་རྒྱལ་བ་ཡིས། །བཤད་པའི་ཕན་ཡོན་འདི་དག་ཐོས་ནས་ནི།
en: “Therefore, having heard the benefits That have been taught by the unsurpassable Jina,

source: །ཏིང་འཛིན་འདི་ནི་མྱུར་དུ་ལུང་མནོད་ཀྱིས།
en: You should quickly become instructed in this samādhi.

source: །བྱང་ཆུབ་མཆོག་ནི་རྙེད་པར་དཀའ་མི་འགྱུར།
en: And then the attainment of supreme enlightenment will not be difficult.” {25}

source: །ཏིང་ངེ་འཛིན་ཡོངས་སུ་སྦྱང་བ་བྱ་བའི་ལེའུ་སྟེ་དྲུག་པའོ།། །།
en: Conclusion of the sixth chapter, “Cultivation of the Samādhi.” The Attainment of Patience Chapter 7
